/****************************************************************************************
* 文件名：configuration.h
* 功能：用于系统硬件初始化，板级驱动
* 作者：石楚雄
* 日期：2012.02.26
* 备注：进主函数后首先调用次函数 
****************************************************************************************/
#ifndef  GONFIGURATION_H
#define  GONFIGURATION_H


//定义ADC常规组数据寄存器基地址（硬件REGS映射地址）
#define  ADC1_DR_Address    ((u32)0x4001244C)
#define  SYSTEM_BEAT20MS    1440000
#define  SYSTEM_BEAT10MS    720000


/****************************************************************************
* 名称：RCC_Configuration()
* 功能：配置系统时钟到72M
* 入口参数：无
* 出口参数：无
* 说明：操作失败原因是PLL未准备好。
****************************************************************************/
extern  void RCC_Configuration(void);


/****************************************************************************
* 名称：NVIC_Configuration()
* 功能：配置各外设中断优先级
* 入口参数：无
* 出口参数：无
****************************************************************************/
extern  void NVIC_Configuration(void);



/****************************************************************************
* 名称：GPIO_Configuration()
* 功能：配置各IO口的输入输出
* 入口参数：无
* 出口参数：无
* 说明：IO口的时钟初始化要放在最前面
****************************************************************************/
extern  void GPIO_Configuration(void);


/****************************************************************************
* 名称：ADC1_Configuration()
* 功能：配置AD采样速率及数据的储存
* 入口参数：无
* 出口参数：无
* 说明：转换数据直接存放在DMA中
****************************************************************************/
extern void ADC1_Configuration(void);


/****************************************************************************
* 名称：ADC1_ENABLE()
* 功能：使能ADC1软件开始转换
* 入口参数：无
* 出口参数：无
* 说明：
****************************************************************************/
extern void ADC1_Enable(void);



/****************************************************************************
* 名称：ADC1_DISABLE()
* 功能：使能ADC1软件停止转换
* 入口参数：无
* 出口参数：无
* 说明：
****************************************************************************/
extern void ADC1_Disable(void);

/****************************************************************************
* 名称：ADC2_Configuration()
* 功能：配置AD采样速率及数据的储存
* 入口参数：无
* 出口参数：无
* 说明：转换数据直接存放在DMA中
****************************************************************************/
extern void ADC2_Configuration(void);


/****************************************************************************
* 名称：ADC2_ENABLE()
* 功能：使能ADC2软件开始转换
* 入口参数：无
* 出口参数：无
* 说明：
****************************************************************************/
extern void ADC2_Enable(void);



/****************************************************************************
* 名称：ADC2_DISABLE()
* 功能：使能ADC2软件停止转换
* 入口参数：无
* 出口参数：无
* 说明：
****************************************************************************/
extern void ADC2_Disable(void);



/****************************************************************************
* 名称：SysTick_Configuration()
* 功能：配置系统滴答时钟，设置节拍为20ms
* 入口参数：无
* 出口参数：无
* 说明：配置好后系统节拍即启动。
****************************************************************************/
extern void SysTick_Configuration(void);

/****************************************************************************
* 名称：SysTick_ITEnable()
* 功能：使能系统时钟中断
* 入口参数：无
* 出口参数：无
* 说明：便于程序控制SysTick中断的使能状态。
****************************************************************************/
extern  void SysTick_ITEnable(void);

/****************************************************************************
* 名称：SysTick_ITDisable()
* 功能：失能系统时钟中断
* 入口参数：无
* 出口参数：无
* 说明：便于程序控制SysTick中断的使能状态。
****************************************************************************/
extern  void SysTick_ITDisable(void);


/****************************************************************************
* 名称：TIM3_Configuration()
* 功能：配置定时器3
* 入口参数：无
* 出口参数：无
* 说明：进中断后处理数据。
****************************************************************************/
extern void TIM3_Configuration(void);



/****************************************************************************
* 名称：TIM3_ITDisable()
* 功能：使能TIM3中断
* 入口参数：无
* 出口参数：无
* 说明：便于程序控制TIM3中断的使能状态。
****************************************************************************/
extern  void TIM3_ITEnable(void) ;



/****************************************************************************
* 名称：TIM3_ITDisable()
* 功能：失能TIM3时钟中断
* 入口参数：无
* 出口参数：无
* 说明：便于程序控制TIM3中断的使能状态。
****************************************************************************/
extern  void TIM3_ITDisable(void) ;


/****************************************************************************
* 名称：DMA_Configuration()
* 功能：配置DMA,用于快速存储大量数据
* 入口参数：无
* 出口参数：无
* 说明：与AD连用。
****************************************************************************/
extern  void DMA_Configuration(void);


/****************************************************************************
* 名称：USART_Configuration()
* 功能：配置串口
* 入口参数：无
* 出口参数：无
* 说明：串口通讯时使用
****************************************************************************/
extern  void USART_Configuration(void);


/****************************************************************************
* 名称：ConfigInit()
* 功能：初始化系统
* 入口参数：无
* 出口参数：无
****************************************************************************/
extern  void ConfigInit(void);

#endif 
